{
  "heroSection": {
    "name": "Jesse Lee Wauer",
    "role": "Frontend Entwickler"
  }, 
  
  "navbar": {
    "whyMe": "Warum ich?",
    "skills": "Fähigkeiten",
    "projects": "Projekte",
    "contact": "Kontakt"
  },

  "whyMe": {
  "header": "Warum ich",
  "location": "Berlin, Deutschland",
  "remote": "Offen für Remote Arbeit",
  "text": "Programmieren begeistert mich, weil ich gerne Dinge verstehe und Probleme Schritt für Schritt löse. Ich mag es, wenn aus einer Idee am Ende etwas Funktionierendes entsteht. Dabei arbeite ich strukturiert und bleibe dran, auch wenn es mal kompliziert wird. Im Team tausche ich mich gerne aus, um gemeinsam bessere Lösungen zu finden.",
  "contactButton": "Kontakt aufnehmen"
},

"mySkills": {
  "header": "Meine Fähigkeiten",
  "currentlyLearning": {
    "title": "Ich lerne aktuell",
    "goal": "Ich lerne regelmäßig neue Technologien und vertiefe mein Wissen Schritt für Schritt. So kann ich mein Können weiterentwickeln und gezielt in meinen Projekten einsetzen."

  }
},

"myProjects": {
  "header": "Meine Projekte",
  "aboutTheProject": "Über das Projekt:",
  "organisation": "Organisation des Projektes:",
  "whatILearned": "Lernziel aus dem Projekt:",
  "technologies": "Technologien",
  "liveTest": "Live testen",
  "github": "GitHub",

  "join": {
    "aboutTheProject": "Join ist ein Social-Network-Projekt, bei dem Nutzer Beiträge teilen, kommentieren und liken können, um sich in einer Community zu vernetzen.",
    "organisation": "Ich habe den Fokus auf saubere Struktur, übersichtliche UI und die Anbindung von Daten gelegt – inklusive Auth/Storage über Firebase.",
    "whatILearned": "Ich habe gelernt, wie man Daten mit Firebase einbindet, Features Schritt für Schritt umsetzt und dabei die Code-Struktur sauber hält."
  },

  "elPolloLoco": {
    "aboutTheProject": "Ein Cartoon-Style Jump-and-Run: Sammle Münzen, weiche Gegnern aus und kämpfe dich durch die Wüste bis zum Boss.",
    "organisation": "Das Spiel ist in Level-Logik, Charaktere und Collision-Handling aufgeteilt. Animations- und Sound-Logik wurden sauber getrennt umgesetzt.",
    "whatILearned": "Ich habe viel über objektorientiertes JavaScript, Game-Loops, Collision-Detection und ein gutes Zusammenspiel von Assets gelernt."
  },

  "pokedex": {
    "aboutTheProject": "Eine responsive Pokédex-App mit Kartenansicht, Typ-Farben und Icons. Nutzer können scrollen und nach Name oder ID suchen.",
    "organisation": "Die Daten werden über eine API geladen und in einer klaren UI dargestellt. Suche und Detailansicht sind so aufgebaut, dass alles schnell reagiert.",
    "whatILearned": "Ich habe geübt, mit APIs zu arbeiten, Daten zu verarbeiten und eine UI zu bauen, die auch auf Mobile gut funktioniert."
  }
},

"references": {
  "header": "Teamplayer benötigt? Das sagen meine Kollegen über mich",
  "projectTitle": "Projekt:",
  "linkedin": "LinkedIn Profil ansehen",

  "person1": {
    "name": "Max Mustermann",
    "project": "Join (Scrum Teamprojekt)",
    "review": "Die Zusammenarbeit war super angenehm. Er arbeitet strukturiert, denkt mit und bleibt auch bei Problemen ruhig und lösungsorientiert."
  },
  "person2": {
    "name": "Anna Beispiel",
    "project": "El Pollo Loco (Spielprojekt)",
    "review": "Sehr zuverlässig und teamorientiert. Aufgaben werden sauber umgesetzt und man merkt, dass Qualität ihm wichtig ist."
  },
  "person3": {
    "name": "Lukas Demo",
    "project": "Pokedex (API Projekt)",
    "review": "Gute Kommunikation und starkes technisches Verständnis. Bringt eigene Ideen ein und unterstützt das Team aktiv."
  }
}, 

  "contactMe": {
    "header": "Contact me",
    "description": "Du hast ein spannendes Projekt oder eine Idee? Schreib mir gerne – ich freue mich auf deine Nachricht.",

    "email": "wauer.j@hotmail.de",
    "phone": "0157 123 456 68",

    "form": {
      "name": "Dein Name",
      "email": "Deine E-Mail",
      "message": "Deine Nachricht",
      "privacyText": "Ich habe die",
      "privacyLink": "Datenschutzerklärung",
      "send": "Senden",
      "thankYou": "Danke für deine Nachricht. Ich melde mich bei dir.",
      "errors": {
      "name": "Bitte gib deinen Namen ein.",
      "email": "Bitte gib eine gültige E-Mail Adresse ein.",
      "message": "Bitte gib eine Nachricht ein."
    }
    }

    

  }





}
