{
  "heroSection": {
    "name": "Jesse Lee Wauer",
    "role": "Frontend Developer"
  },

  "navbar": {
    "whyMe": "Why me?",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },

  "whyMe": {
  "header": "Why me",
  "location": "Berlin, Germany",
  "remote": "Open to remote work",
  "text": "I enjoy coding because I like understanding how things work and solving problems step by step. I find it motivating to turn an idea into something that actually works. I stay focused even when things get complex, and I appreciate working with others to find better solutions together.",
  "contactButton": "Get in touch"
},

"mySkills": {
  "header": "My Skills",
  "currentlyLearning": {
    "title": "I am currently learning",
    "goal": "I regularly learn new technologies and deepen my knowledge step by step. This helps me grow my skills and apply them more effectively in my projects."

  }
},

"myProjects": {
  "header": "My Projects",
  "aboutTheProject": "About the project:",
  "organisation": "Project organisation:",
  "whatILearned": "What I learned:",
  "technologies": "Technologies",
  "liveTest": "Live demo",
  "github": "GitHub",

  "join": {
    "aboutTheProject": "Join is a social network project where users can share posts, comment, and like content to connect within a community.",
    "organisation": "I focused on a clean structure, a clear UI, and connecting data — including authentication/storage with Firebase.",
    "whatILearned": "I learned how to integrate Firebase data, build features step by step, and keep the overall code structure maintainable."
  },

  "elPolloLoco": {
    "aboutTheProject": "A cartoon-style jump and run: collect coins, avoid enemies, and fight your way through the desert to the final boss.",
    "organisation": "The game is split into level logic, characters, and collision handling. Animation and sound logic are implemented in a structured way.",
    "whatILearned": "I learned a lot about object-oriented JavaScript, game loops, collision detection, and working with game assets."
  },

  "pokedex": {
    "aboutTheProject": "A responsive Pokédex app with interactive cards, type-based colors and icons. Users can scroll and search by name or ID.",
    "organisation": "Data is loaded via an API and displayed in a clean UI. Search and details are built to stay fast and responsive.",
    "whatILearned": "I improved my API workflow, data handling, and building a UI that works well on mobile devices."
  }
},

"references": {
  "header": "Need a teamplayer? Here’s what my colleagues say about me",
  "projectTitle": "Project:",
  "linkedin": "View LinkedIn profile",

  "person1": {
    "name": "Max Mustermann",
    "project": "Join (Scrum team project)",
    "review": "Working together was great. He stays organized, thinks ahead, and keeps a calm, solution-focused mindset when problems come up."
  },
  "person2": {
    "name": "Anna Beispiel",
    "project": "El Pollo Loco (game project)",
    "review": "Very reliable and supportive in a team. Tasks are implemented cleanly and you can tell quality matters to him."
  },
  "person3": {
    "name": "Lukas Demo",
    "project": "Pokedex (API project)",
    "review": "Great communication and strong technical understanding. He contributes ideas and actively supports the team."
  }
},

  "contactMe": {
    "header": "Contact me",
    "description": "Do you have an interesting project or idea? Feel free to reach out. I’m looking forward to your message.",

    "email": "wauer.j@hotmail.de",
    "phone": "+49 157 123 456 68",

    "form": {
      "name": "Your name",
      "email": "Your email",
      "message": "Your message",
      "privacyText": "I have read the",
      "privacyLink": "privacy policy",
      "send": "Send",
      "thankYou": "Thank you for your message. I will get back to you as soon as possible.",
      "errors": {
      "name": "Please enter your name.",
      "email": "Please enter a valid email address.",
      "message": "Please enter a message."
      } 
    }
  },

  "footer": {
  "legalNotice": "Legal notice"
  },

  "legalNotice": {
  "title": "Legal Notice",
  "contactEmail": "wauer.j@hotmail.de",
  "imprint": {
    "title": "Imprint",
    "line1": "Jesse Lee Wauer",
    "line2": "Lange Straße 81",
    "line3": "10243 Berlin"
  },
  "exploring": {
    "title": "Exploring the Board",
    "email": "Email"
  },
  "acceptance": {
    "title": "Acceptance of terms",
    "text": "By accessing and using Portfolio (Product), you acknowledge and agree to the following terms and conditions, and any policies, guidelines, or amendments thereto that may be presented to you from time to time. We, the listed students, may update or change the terms and conditions from time to time without notice."
  },
  "scope": {
    "title": "Scope and ownership of the product",
    "text1": "Portfolio has been developed as part of a student group project in a web development bootcamp at the Developer Akademie GmbH. It has an educational purpose and is not intended for extensive personal & business usage. As such, we cannot guarantee consistent availability, reliability, accuracy, or any other aspect of quality regarding this Product.",
    "text2": "The design of Portfolio is owned by the Developer Akademie GmbH. Unauthorized use, reproduction, modification, distribution, or replication of the design is strictly prohibited."
  },
  "rights": {
    "title": "Proprietary rights",
    "text": "Aside from the design owned by Developer Akademie GmbH, we, the listed students, retain all proprietary rights in Portfolio, including any associated copyrighted material, trademarks, and other proprietary information."
  },
  "use": {
    "title": "Use of the product",
    "text": "Portfolio is intended to be used for lawful purposes only, in accordance with all applicable laws and regulations. Any use of Portfolio for illegal activities, or to harass, harm, threaten, or intimidate another person, is strictly prohibited. You are solely responsible for your interactions with other users of Portfolio."
  },
  "disclaimer": {
    "title": "Disclaimer of warranties and limitation of liability",
    "text": "Portfolio is provided \"as is\" without warranty of any kind, whether express or implied, including but not limited to the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. In no event will we, the listed students, or the Developer Akademie, be liable for any direct, indirect, incidental, special, consequential or exemplary damages, including but not limited to, damages for loss of profits, goodwill, use, data, or other intangible losses, even if we have been advised of the possibility of such damages, arising out of or in connection with the use or performance of Portfolio."
  },
  "indemnity": {
    "title": "Indemnity",
    "text": "You agree to indemnify, defend and hold harmless us, the listed students, the Developer Akademie, and our affiliates, partners, officers, directors, agents, and employees, from and against any claim, demand, loss, damage, cost, or liability (including reasonable legal fees) arising out of or relating to your use of Portfolio and/or your breach of this Legal Notice."
  },
  "questions": "For any questions or notices, please contact us at",
  "date": "Date: February 26, 2026"
  }




}
